thorrak/brewpi-esp8266/PiLink.cpp
/*
 * Copyright 2012-2013 BrewPi/Elco Jacobs.
 * Copyright 2013 Matthew McGowan.
 *
 * This file is part of BrewPi.
 * 
 * BrewPi is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 * 
 * BrewPi is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 * 
 * You should have received a copy of the GNU General Public License
 * along with BrewPi.  If not, see <http://www.gnu.org/licenses/>.
 */

#include "Brewpi.h"
#include <stdarg.h>

#include "stddef.h"
#include "PiLink.h"

#include "Version.h"
#include "TempControl.h"
#include "Display.h"
#include "JsonKeys.h"
#include "Ticks.h"
#include "Brewpi.h"
#include "EepromManager.h"
#include "EepromFormat.h"
#include "SettingsManager.h"
#include "Buzzer.h"
#include "Display.h"

#ifdef ESP8266_WiFi
#include <ESP8266WiFi.h>          //ESP8266 Core WiFi Library
#endif

#ifdef ARDUINO
#ifndef ESP8266
#include "util/delay.h"
#endif
#endif

#if BREWPI_SIMULATE
#include "Simulator.h"
#endif

 // Rename Serial to piStream, to abstract it for later platform independence

#if BREWPI_EMULATE
	class MockSerial : public Stream
	{
		public:
		void print(char c) {}
		void print(const char* c) {}
		void printNewLine() {}
                void println() {}
		int read() { return -1; }
		int available() { return -1; }
		void begin(unsigned long) {}
		size_t write(uint8_t w) { return 1; }
		int peek() { return -1; }
		void flush() { };			
		operator bool() { return true; }
	};

	static MockSerial mockSerial;
	#define piStream mockSerial
#elif !defined(ARDUINO)
        StdIO stdIO;
        #define piStream stdIO
#elif defined(ESP8266_WiFi)
/*class TelnetSerial : public Stream
{
private:
	String inputBuf = "";
	String outputBuf = "";

public:
	void print(char c) {}
	void print(const char* c) {}
	void printNewLine() {}
	void println() {}

	int read() { 
		return -1; 
	}

	int available() { return -1; }
	void begin(unsigned long) {}
	size_t write(uint8_t w) { return 1; }
	int peek() { return -1; }
	void flush() { };

	void bufferFromConnected() {
		uint8_t i;
		//check clients for data
		for (i = 0; i < MAX_SRV_CLIENTS; i++) {
			if (serverClients[i] && serverClients[i].connected()) {
				if (serverClients[i].available()) {
					//get data from the telnet client and push it to the UART
					while (serverClients[i].available())
						inputBuf.concat(serverClients[i].read());
				}
			}
		}
		nukeBufferIfDisconneted();
		return;
	}

	void nukeBufferIfDisconneted() {
		uint8_t i;
		bool clientConnected = false;
		for (i = 0; i < MAX_SRV_CLIENTS; i++)
			if (serverClients[i] && serverClients[i].connected())
				clientConnected = true;

		if (!clientConnected) {
			// Nuke the buffers if no clients are connected
			inputBuf = "";
			outputBuf = "";
		}
	}

	operator bool() { return true; }
};*/

//static TelnetSerial telnetSerial;
//#define piStream telnetSerial

// Just use the serverClient object as it supports all the same functions as Serial
extern WiFiServer server;
extern WiFiClient serverClient;
#define piStream serverClient

#else
// Not using ESP8266 WiFi
#define piStream Serial
#endif

bool PiLink::firstPair;
char PiLink::printfBuff[PRINTF_BUFFER_SIZE];
                
void PiLink::init(void){
#ifndef ESP8266_WiFi
piStream.begin(57600);
#endif
}

extern void handleReset();

// create a printf like interface to the Arduino Serial function. Format string stored in PROGMEM
void PiLink::print_P(const char *fmt, ... ){
	va_list args;
	va_start (args, fmt );
	vsnprintf_P(printfBuff, PRINTF_BUFFER_SIZE, fmt, args);
//	vsnprintf(printfBuff, PRINTF_BUFFER_SIZE, fmt, args);
	va_end (args);
#ifdef ESP8266_WiFi
	if (piStream && piStream.connected()) { // if WiFi client connected
//		yield();
		piStream.print(printfBuff);
//		yield();
//		delay(5);
	}
#else
	if(piStream){ // if Serial connected (on Leonardo)
		piStream.print(printfBuff);
	}
#endif
}

// create a printf like interface to the Arduino Serial function. Format string stored in RAM
void PiLink::print(char *fmt, ... ){
	va_list args;
	va_start (args, fmt );
	vsnprintf(printfBuff, PRINTF_BUFFER_SIZE, fmt, args);
	va_end (args);
#ifdef ESP8266_WiFi
	if (piStream && piStream.connected()) { // if WiFi client connected
//		yield();
		piStream.print(printfBuff);
//		yield();
//		delay(5);
	}
#else
	if (piStream) { // if Serial connected (on Leonardo)
		piStream.print(printfBuff);
	}
#endif
}

#ifdef ESP8266
void PiLink::print(char out) {
#ifdef ESP8266_WiFi
	if (piStream && piStream.connected()) { // if WiFi client connected
		piStream.print(out);
	}
#else
	if (piStream) { // if Serial connected (on Leonardo)
		piStream.print(out);
	}
#endif
}
#endif

void PiLink::printNewLine(){
#ifdef ESP8266_WiFi
	if (piStream && piStream.connected()) { // if WiFi client connected
		piStream.println();
		yield();
		delay(100); // Give the controller enough time to transmit the full message
	}
#else
	if (piStream) { // if Serial connected (on Leonardo)
		piStream.println();
	}
#endif
}

#if BREWPI_EEPROM_HELPER_COMMANDS
void printNibble(uint8_t n)
{
	n &= 0xF;
#ifdef ESP8266_WiFi
	if (piStream && piStream.connected()) { // if WiFi client connected
		piStream.print((char)(n >= 10 ? n - 10 + 'A' : n + '0'));
	}
#else
	if (piStream) { // if Serial connected (on Leonardo)
		piStream.print((char)(n >= 10 ? n - 10 + 'A' : n + '0'));
	}
#endif
}
#endif

// Trying to enforce that the only thing to talk to piStream is piLink
int PiLink::read() {
	return piStream.read();
}

void PiLink::receive(void){
	while (piStream.available() > 0) {
		char inByte = read();              
		switch(inByte){
		case ' ':
		case '\n':
		case '\r':
#ifdef ESP8266_WiFi  // Control characters sent when establishing a telnet session 
		case 1:
		case 3:
		case 29:
		case 31:
		case '\'':
		case 251:
		case 253:
		case 255:
#endif
			break;

#if BREWPI_SIMULATE==1
		case 'y':
			parseJson(HandleSimulatorConfig);
			break;
		case 'Y':
			printSimulatorSettings();
			break;		
#endif						
		case 'A': // alarm on
			soundAlarm(true);
			break;
		case 'a': // alarm off
			soundAlarm(false);
			break;
			
		case 't': // temperatures requested
			printTemperatures();      
			break;		
		case 'C': // Set default constants
			tempControl.loadDefaultConstants();
			display.printStationaryText(); // reprint stationary text to update to right degree unit
			sendControlConstants(); // update script with new settings
			logInfo(INFO_DEFAULT_CONSTANTS_LOADED);
			break;
		case 'S': // Set default settings
			tempControl.loadDefaultSettings();
			sendControlSettings(); // update script with new settings
			logInfo(INFO_DEFAULT_SETTINGS_LOADED);
			break;
		case 's': // Control settings requested
			sendControlSettings();
			break;
		case 'c': // Control constants requested
			sendControlConstants();
			break;
		case 'v': // Control variables requested
			sendControlVariables();
			break;
		case 'n':
			// v version
			// s shield type
			// y: simulator			
			// b: board
#ifndef ESP8266
			print_P(PSTR("N:{\"v\":\"%S\",\"n\":%d,\"c\":\"%S\",\"s\":%d,\"y\":%d,\"b\":\"%c\",\"l\":\"%d\"}"), 
					PSTR(VERSION_STRING), 
					BUILD_NUMBER,
					PSTR(BUILD_NAME),
					BREWPI_STATIC_CONFIG, 
					BREWPI_SIMULATE, 
					BREWPI_BOARD,
					BREWPI_LOG_MESSAGES_VERSION);
#else
			// Doesn't appear to be support for %S for some reason. Replacing by breaking everything out.
			print("N:{\"v\":\"");
			print(VERSION_STRING);
			print("\",\"n\":%d,\"c\":\"", BUILD_NUMBER);
			print(BUILD_NAME);
			print("\",\"s\":%d,\"y\":%d,\"b\":\"%c\",\"l\":\"%d\"}", 
				BREWPI_STATIC_CONFIG,
				BREWPI_SIMULATE,
				BREWPI_BOARD,
				BREWPI_LOG_MESSAGES_VERSION);
#endif
			printNewLine();
			break;
		case 'l': // Display content requested
			openListResponse('L');
			char stringBuffer[21];
			for(uint8_t i=0;i<4;i++){
				display.getLine(i, stringBuffer);
				print_P(PSTR("\"%s\""), stringBuffer);
				char close = (i<3) ? ',':']';
				print(close);
			}							
			printNewLine();						
			break;
		case 'j': // Receive settings as json
			receiveJson();
			break;

#if BREWPI_EEPROM_HELPER_COMMANDS
		case 'e': // dump contents of eeprom						
			openListResponse('E');
			for (uint16_t i=0; i<1024;) {
				if (i>0) {
					piLink.printNewLine();
					piLink.print(',');
				}
				piLink.print('\"');
				for (uint8_t j=0; j<64; j++) {
					uint8_t d = eepromAccess.readByte(i++);
					printNibble(d>>4);
					printNibble(d);
				}				
				piLink.print('\"');
			}
			closeListResponse();
			break;
#endif
			
		case 'E': // initialize eeprom
			eepromManager.initializeEeprom();
			logInfo(INFO_EEPROM_INITIALIZED);
			settingsManager.loadSettings();
			break;

		case 'd': // list devices in eeprom order
			openListResponse('d');
			deviceManager.listDevices();
			closeListResponse();
			break;

		case 'U': // update device		
			//printResponse('U'); // moved into function below, because installing devices can cause printing in between
			deviceManager.parseDeviceDefinition(piStream);
			//piLink.printNewLine();
			break;
			
		case 'h': // hardware query
			openListResponse('h');
			deviceManager.enumerateHardware();
			closeListResponse();
			break;

