thorrak/brewpi-esp8266/PiLink.cpp
void PiLink::setBeerSetting(const char* val) {
	const char* source = NULL;
	temperature newTemp = stringToTemp(val);
	if(tempControl.cs.mode == 'p'){
		if(abs(newTemp-tempControl.cs.beerSetting) > 100){ // this excludes gradual updates under 0.2 degrees
			source = STR_TEMPERATURE_PROFILE;
		}
	}
	else {
		source = STR_WEB_INTERFACE;
	}
	if (source)
		printBeerAnnotation(STR_FMT_SET_TO, STR_BEER_TEMP, val, source);
	tempControl.setBeerTemp(newTemp);		
}

void PiLink::setFridgeSetting(const char* val) {
	temperature newTemp = stringToTemp(val);
	if(tempControl.cs.mode == 'f'){
		printFridgeAnnotation(STR_FMT_SET_TO, STR_FRIDGE_TEMP, val, STR_WEB_INTERFACE);
	}
	tempControl.setFridgeTemp(newTemp);	
}

void PiLink::setTempFormat(const char* val) {
	tempControl.cc.tempFormat = val[0];
	display.printStationaryText(); // reprint stationary text to update to right degree unit
	eepromManager.storeTempConstantsAndSettings();
}


// todo - move these structs to PROGMEM.
enum FilterType { FAST, SLOW, SLOPE };
enum TempSensorTarget { FRIDGE, BEER };

static uint8_t* const filterSettings[] = {
		&tempControl.cc.fridgeFastFilter,
		&tempControl.cc.fridgeSlowFilter,
		&tempControl.cc.fridgeSlopeFilter,
		&tempControl.cc.beerFastFilter,
		&tempControl.cc.beerSlowFilter,
		&tempControl.cc.beerSlopeFilter		
	};
	
#define MAKE_FILTER_SETTING_TARGET(filterType, sensorTarget)  (void*)(uint8_t(filterType)+uint8_t(sensorTarget)*3)

void applyFilterSetting(const char* val, void* target) {
	// the cast was  (uint8_t(uint16_t(target), changed to unsigned int so that the
	// first cast is the same width as a pointer, avoiding a warning
	// On x64 builds, unsigned int is still 32 bits, so cast to uint64_t instead
	#if defined(_M_X64) || defined(__amd64__)
		uint8_t offset = uint8_t((uint64_t) target);		// target is really just an integer
        #else
        	uint8_t offset = uint8_t((unsigned int) target);		// target is really just an integer
        #endif
        
	FilterType filterType = FilterType(offset&3);
	TempSensorTarget sensorTarget = TempSensorTarget(offset/3);
	
	uint8_t value = atol(val);
	uint8_t* const location = filterSettings[offset];
	*location = value;
	TempSensor* sensor = sensorTarget ? tempControl.beerSensor : tempControl.fridgeSensor;
	switch (filterType) {
		case FAST: sensor->setFastFilterCoefficients(value); break;
		case SLOW: sensor->setSlowFilterCoefficients(value); break;
		case SLOPE: sensor->setSlopeFilterCoefficients(value); break;
	}
	eepromManager.storeTempConstantsAndSettings();
}

void setStringToFixedPoint(const char* value, temperature* target) {
	*target = stringToFixedPoint(value);
	eepromManager.storeTempConstantsAndSettings();
}
void setStringToTemp(const char* value, temperature* target) {
	*target = stringToTemp(value);
	eepromManager.storeTempConstantsAndSettings();
}
void setStringToTempDiff(const char* value, temperature* target) {
	*target = stringToTempDiff(value);
	eepromManager.storeTempConstantsAndSettings();
}
void setUint16(const char* value, uint16_t* target) {
	*target = atol(value);
	eepromManager.storeTempConstantsAndSettings();
}
void setBool(const char* value, uint8_t* target) {
	*target = (atol(value)!=0);
	eepromManager.storeTempConstantsAndSettings();
}


#define JSON_CONVERT(jsonKey, target, fn) { jsonKey, target, (JsonParserHandlerFn)&fn }

const PiLink::JsonParserConvert PiLink::jsonParserConverters[] PROGMEM = {
	JSON_CONVERT(JSONKEY_mode, NULL, setMode),
	JSON_CONVERT(JSONKEY_beerSetting, NULL, setBeerSetting),
	JSON_CONVERT(JSONKEY_fridgeSetting, NULL, setFridgeSetting),
	
	JSON_CONVERT(JSONKEY_heatEstimator, &tempControl.cs.heatEstimator, setStringToFixedPoint),
	JSON_CONVERT(JSONKEY_coolEstimator, &tempControl.cs.coolEstimator, setStringToFixedPoint),
	
	JSON_CONVERT(JSONKEY_tempFormat, NULL, setTempFormat),
	
	JSON_CONVERT(JSONKEY_tempSettingMin, &tempControl.cc.tempSettingMin, setStringToTemp),
	JSON_CONVERT(JSONKEY_tempSettingMax, &tempControl.cc.tempSettingMax, setStringToTemp),
	JSON_CONVERT(JSONKEY_pidMax, &tempControl.cc.pidMax, setStringToTempDiff),

	JSON_CONVERT(JSONKEY_Kp, &tempControl.cc.Kp, setStringToFixedPoint),
	JSON_CONVERT(JSONKEY_Ki, &tempControl.cc.Ki, setStringToFixedPoint),
	JSON_CONVERT(JSONKEY_Kd, &tempControl.cc.Kd, setStringToFixedPoint),

	JSON_CONVERT(JSONKEY_iMaxError, &tempControl.cc.iMaxError, setStringToTempDiff),
	JSON_CONVERT(JSONKEY_idleRangeHigh, &tempControl.cc.idleRangeHigh, setStringToTempDiff),
	JSON_CONVERT(JSONKEY_idleRangeLow, &tempControl.cc.idleRangeLow, setStringToTempDiff),
	JSON_CONVERT(JSONKEY_heatingTargetUpper, &tempControl.cc.heatingTargetUpper, setStringToTempDiff),
	JSON_CONVERT(JSONKEY_heatingTargetLower, &tempControl.cc.heatingTargetLower, setStringToTempDiff),
	JSON_CONVERT(JSONKEY_coolingTargetUpper, &tempControl.cc.coolingTargetUpper, setStringToTempDiff),
	JSON_CONVERT(JSONKEY_coolingTargetLower, &tempControl.cc.coolingTargetLower, setStringToTempDiff),
	JSON_CONVERT(JSONKEY_maxHeatTimeForEstimate, &tempControl.cc.maxHeatTimeForEstimate, setUint16),
	JSON_CONVERT(JSONKEY_maxCoolTimeForEstimate, &tempControl.cc.maxCoolTimeForEstimate, setUint16),
	JSON_CONVERT(JSONKEY_lightAsHeater, &tempControl.cc.lightAsHeater, setBool),
	JSON_CONVERT(JSONKEY_rotaryHalfSteps, &tempControl.cc.rotaryHalfSteps, setBool),
	
	JSON_CONVERT(JSONKEY_fridgeFastFilter, MAKE_FILTER_SETTING_TARGET(FAST, FRIDGE), applyFilterSetting),
	JSON_CONVERT(JSONKEY_fridgeSlowFilter, MAKE_FILTER_SETTING_TARGET(SLOW, FRIDGE), applyFilterSetting),
	JSON_CONVERT(JSONKEY_fridgeSlopeFilter, MAKE_FILTER_SETTING_TARGET(SLOPE, FRIDGE), applyFilterSetting),
	JSON_CONVERT(JSONKEY_beerFastFilter, MAKE_FILTER_SETTING_TARGET(FAST, BEER), applyFilterSetting),
	JSON_CONVERT(JSONKEY_beerSlowFilter, MAKE_FILTER_SETTING_TARGET(SLOW, BEER), applyFilterSetting),
	JSON_CONVERT(JSONKEY_beerSlopeFilter, MAKE_FILTER_SETTING_TARGET(SLOPE, BEER), applyFilterSetting)
	
};

void PiLink::processJsonPair(const char * key, const char * val, void* pv){
	logInfoStringString(INFO_RECEIVED_SETTING, key, val);
	
	for (uint8_t i=0; i<sizeof(jsonParserConverters)/sizeof(jsonParserConverters[0]); i++) {
		JsonParserConvert converter;
		memcpy_P(&converter, &jsonParserConverters[i], sizeof(converter));		
		//logDeveloper("Handling converter %d %s %S %d %d"), i, key, converter.key, converter.fn, converter.target);
		if (strcmp_P(key,converter.key) == 0) {
			//logDeveloper("Handling json key %s"), key);
			converter.fn(val, converter.target);
			return;
		}
	}					
	logWarning(WARNING_COULD_NOT_PROCESS_SETTING);
}

void PiLink::soundAlarm(bool active)
{
	alarm.setActive(active);
}


#ifndef ARDUINO
void PiLink::print(char c) { piStream.print(c); }
#endif


